Reports/ОтделТехническогоКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>ОтделТехническогоКонтроля</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/СтатусСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтатусСпецификации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСпецификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>СтатусыСпецификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеМатериала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданВЦех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверяется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Размещен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассчитывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сохранен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Установлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПакетыУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ПакетыУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоКлиентаИМонтаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоОфиса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоТранспортнойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамовывозОтПроизводителя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НарядЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>НарядЗадание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОбрезкиМатериалов</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСпецификаций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОстаткиЛистовогоМатериала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВысотаОстатка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаОстатка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОстаткиХлыстов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаскройХлыстов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Двери</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Двери</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерХлыста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерХлыста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЛистовНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЛистовыхДеталей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоТребуется</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатурыПоСпецификациям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Двери</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Двери</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредоставитЗаказчик</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокСпецификаций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсобыеУслуги</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Срочный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНаряда</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветЛДСПОсновной</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокХлыстовыхМатериалов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ОтделТехническогоКонтроля/Ext/ManagerModule.bsl
Функция СформироватьОтчет(ТабДок, Подразделение, КлиентскаяДата) Экспорт
	
	#Если Никогда Тогда
		ТабДок = Новый ТабличныйДокумент;
	#КонецЕсли
	
	ТабДок.Очистить();
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = Отчеты.ОтделТехническогоКонтроля.ПолучитьМакет("МакетОтделТехническогоКонтроля");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВЦеху = Макет.ПолучитьОбласть("ВЦеху");
	ОбластьНаСкладе = Макет.ПолучитьОбласть("НаСкладе");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрокаВыделить = Макет.ПолучитьОбласть("СтрокаВыделить");
	ОбластьСтрокаКрасная = Макет.ПолучитьОбласть("СтрокаКрасная");
	
	ОбластьСтрокаБезКартинки = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрокаВыделитьБезКартинки = Макет.ПолучитьОбласть("СтрокаВыделить");
	ОбластьСтрокаКраснаяБезКартинки = Макет.ПолучитьОбласть("СтрокаКрасная");
	
	Для Каждого Рис Из ОбластьСтрокаКраснаяБезКартинки.Рисунки Цикл
		ОбластьСтрокаКраснаяБезКартинки.Рисунки.Очистить();
	КонецЦикла;
	
	Для Каждого Рис Из ОбластьСтрокаБезКартинки.Рисунки Цикл
		ОбластьСтрокаБезКартинки.Рисунки.Очистить();
	КонецЦикла;
	
	Для Каждого Рис Из ОбластьСтрокаВыделитьБезКартинки.Рисунки Цикл
		ОбластьСтрокаВыделитьБезКартинки.Рисунки.Очистить();
	КонецЦикла;
		
	ОбластьЗаметка = Макет.ПолучитьОбласть("Заметка");
	
	ОбластьЗаголовок.Параметры.Подразделение = Подразделение;
	Если ЗначениеЗаполнено(КлиентскаяДата) Тогда
		ДатаСоставления = КлиентскаяДата;
	Иначе
		ДатаСоставления = ТекущаяДата();
	КонецЕсли;
	ОбластьЗаголовок.Параметры.ДатаСоставления = ДатаСоставления;
	
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	докСпецификация.Ссылка КАК Спецификация,
	|	НарядЗаданиеСписокСпецификаций.Ссылка КАК Наряд,
	|	докДоговор.Ссылка КАК Договор,
	|	СтатусСпецификацииСрезПоследних.Статус КАК Статус,
	|	докСпецификация.Контрагент КАК Контрагент,
	|	докСпецификация.Технолог,
	|	докСпецификация.Технолог.ТелефонРабочий КАК ТелефонТехнолога,
	|	Заметки.Содержание КАК СодержаниеЗаметки,
	|	докСпецификация.ДатаОтгрузки,
	|	докСпецификация.ДатаИзготовления,
	|	докСпецификация.АдресМонтажа КАК Адрес,
	|	докСпецификация.Номер КАК НомерСпецификации,
	|	Заметки.Ссылка КАК Заметка,
	|	докСпецификация.ОсобыеУслуги,
	|	докСпецификация.ЦветЛДСПОсновной,
	|	докСпецификация.ЦветЛДСПДополнительный,
	|	докСпецификация.ЦветВертикальногоПрофиля,
	|	докСпецификация.КомплектацияСклад,
	|	докСпецификация.КомплектацияЦех,
	|	докСпецификация.Дилерский,
	|	докСпецификация.Контрагент.Телефон КАК ТелефонДилера,
	|	докСпецификация.Контрагент КАК Дилер,
	|	докСпецификация.Контрагент.ЮридическоеЛицо КАК ДилерЮридическоеЛицо,
	|	докСпецификация.Контрагент.Фамилия КАК ДилерФамилия,
	|	докСпецификация.Контрагент.Имя КАК ДилерИмя,
	|	докСпецификация.Контрагент.Отчество КАК ДилерОтчество,
	|	докСпецификация.ПлощадьСборкиИзделия КАК ПлощадьИзделия,
	|	докСпецификация.КоличествоКоробов,
	|	докСпецификация.Упаковка,
	|	докСпецификация.НазваниеИзделия.КраткоеНаименование КАК Изделие,
	|	НарядЗаданиеСписокСпецификаций.Ссылка.Номер КАК НомерНаряда,
	|	НарядЗаданиеСписокСпецификаций.Ссылка.ДатаИзготовления КАК ДатаИзготовленияНаряда,
	|	докСпецификация.Срочный
	|ИЗ
	|	Документ.Спецификация КАК докСпецификация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусСпецификации.СрезПоследних КАК СтатусСпецификацииСрезПоследних
	|		ПО (СтатусСпецификацииСрезПоследних.Спецификация = докСпецификация.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НарядЗадание.СписокСпецификаций КАК НарядЗаданиеСписокСпецификаций
	|		ПО (НарядЗаданиеСписокСпецификаций.Спецификация = докСпецификация.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Договор КАК докДоговор
	|		ПО (докДоговор.Спецификация = докСпецификация.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Заметки КАК Заметки
	|		ПО докСпецификация.Ссылка = Заметки.Предмет
	|ГДЕ
	|	докСпецификация.Подразделение = &Подразделение
	|	И (СтатусСпецификацииСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификации.ПереданВЦех)
	|			ИЛИ СтатусСпецификацииСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификации.Изготовлен))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статус,
	|	ДатаИзготовленияНаряда
	|ИТОГИ
	|	МАКСИМУМ(НомерНаряда),
	|	МАКСИМУМ(ДатаИзготовленияНаряда)
	|ПО
	|	Статус,
	|	Наряд";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМесто = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаМесто.Следующий() Цикл
		
		Если ВыборкаМесто.Статус = Перечисления.СтатусыСпецификации.Изготовлен Тогда
			ТабДок.Вывести(ОбластьНаСкладе);
		КонецЕсли;
		
		ВыборкаНаряд = ВыборкаМесто.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНаряд.Следующий() Цикл
			
			Если ВыборкаМесто.Статус = Перечисления.СтатусыСпецификации.ПереданВЦех Тогда
				
				ОбластьВЦеху.Параметры.НомерНаряда = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ВыборкаНаряд.НомерНаряда);
				ОбластьВЦеху.Параметры.ДатаИзготовленияНаряда = Формат(ВыборкаНаряд.ДатаИзготовленияНаряда, "ДЛФ=DD");
				ТабДок.Вывести(ОбластьВЦеху);
				
			КонецЕсли;
			
			ВыборкаДетальныеЗаписи = ВыборкаНаряд.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ВыборкаДетальныеЗаписи.Срочный Тогда
					ОбластьВывод = ОбластьСтрокаКрасная;
				ИначеЕсли ВыборкаДетальныеЗаписи.ДатаОтгрузки < КлиентскаяДата Тогда
					ОбластьВывод = ОбластьСтрокаВыделить;
				Иначе
					ОбластьВывод = ОбластьСтрока;
				КонецЕсли;
				
				Если ВыборкаДетальныеЗаписи.Спецификация.ПакетУслуг = Перечисления.ПакетыУслуг.СамовывозОтПроизводителя Тогда
					
					Если ВыборкаДетальныеЗаписи.Срочный Тогда
						ОбластьВывод = ОбластьСтрокаКраснаяБезКартинки;
					ИначеЕсли ВыборкаДетальныеЗаписи.ДатаОтгрузки < КлиентскаяДата Тогда
						ОбластьВывод = ОбластьСтрокаВыделитьБезКартинки;
					Иначе
						ОбластьВывод = ОбластьСтрокаБезКартинки;
					КонецЕсли;
					
				КонецЕсли;
				
				ОбластьВывод.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
				Если ВыборкаДетальныеЗаписи.Адрес = "Введите адрес" Тогда
					ОбластьВывод.Параметры.Адрес = "";
				КонецЕсли;
				
				ПризнакиСпецификации = "%1 / %2 / %3";
				ПризнакиСпецификации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПризнакиСпецификации,
				ВыборкаДетальныеЗаписи.ЦветЛДСПОсновной,
				ВыборкаДетальныеЗаписи.ЦветЛДСПДополнительный,
				ВыборкаДетальныеЗаписи.ЦветВертикальногоПрофиля);
				
				ОбластьВывод.Параметры.ПризнакиСпецификации = ПризнакиСпецификации;
				ОбластьВывод.Параметры.НомерСпецификации = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ВыборкаДетальныеЗаписи.НомерСпецификации);
				ОбластьВывод.Параметры.ТелефонЗаказчика = ВыборкаДетальныеЗаписи.Контрагент.Телефон;
				
				КоличествоДверей = 0;
				Для каждого СтрокаДверь Из ВыборкаДетальныеЗаписи.Спецификация.СписокДверей Цикл
					КоличествоДверей = КоличествоДверей + СтрокаДверь.Двери.Количество;
				КонецЦикла;
				ОбластьВывод.Параметры.КоличествоДверей = КоличествоДверей;
				
				Если ВыборкаДетальныеЗаписи.Дилерский Тогда
					
					ОбластьВывод.Параметры.ТелефонТехнолога = ВыборкаДетальныеЗаписи.ТелефонДилера;
					Если НЕ ВыборкаДетальныеЗаписи.ДилерЮридическоеЛицо Тогда
						ОбластьВывод.Параметры.Технолог = Строка(ВыборкаДетальныеЗаписи.Дилер.Город) + ", " + ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица("" + ВыборкаДетальныеЗаписи.Дилер);
					Иначе
						ОбластьВывод.Параметры.Технолог = Строка(ВыборкаДетальныеЗаписи.Дилер.Город) + ", " + ВыборкаДетальныеЗаписи.Дилер;
					КонецЕсли;
					
				Иначе
					
					ОбластьВывод.Параметры.Технолог = ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(ВыборкаДетальныеЗаписи.Технолог);
					
				КонецЕсли;
				
				ТабДок.Вывести(ОбластьВывод);
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Заметка) Тогда
					
					ОбластьЗаметка.Параметры.Спецификация = ВыборкаДетальныеЗаписи.Спецификация;
					ОбластьЗаметка.Параметры.Заметка = ВыборкаДетальныеЗаписи.Заметка;
					ОбластьЗаметка.Параметры.СодержаниеЗаметки = ВыборкаДетальныеЗаписи.СодержаниеЗаметки.Получить().ПолучитьТекст();
					
					ТабДок.Вывести(ОбластьЗаметка);
					
				КонецЕсли;
				
			КонецЦикла; // ВыборкаДетальныеЗаписи.Следующий()
			
		КонецЦикла; //ВыборкаНаряд.Следующий()
		
	КонецЦикла; // ВыборкаМесто.Следующий()
	
КонецФункции
